STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoLegacy/Modules/calendar/app_calendar.c
/* used to exit application */
static __IO uint8_t UserEvent=0;
static __IO uint8_t UserAction=0;

/* Private typedef -----------------------------------------------------------*/
/* External variables --------------------------------------------------------*/
const K_ModuleItem_Typedef ModuleCalendar =
{
  MODULE_CALENDAR,
  _CalendarConfig,
  _CalendarDemoExec,
  _CalendarExit,
  NULL
};

/* RTC Handle variable */
extern RTC_HandleTypeDef RtcHandle;


/**
  * @brief  setup the HW for Calendar application
  * @param  None.
  * @retval None.
  */
KMODULE_RETURN _CalendarConfig(void)
{
  HAL_StatusTypeDef status = HAL_ERROR;

  /* HAL_RTC_Init has been already called for Backup reg access */
  /* check if Date has been already set one time, else configure it to
  1st of january 2018 */
  if(__HAL_RTC_GET_FLAG(&RtcHandle, RTC_FLAG_INITS) == 0x00u)
  {
    /* Set Date to 01.01.2018 */
    Date.Date = 0x01u;
    Date.Month = 0x01u;
    Date.Year = 0x18u;
    Date.WeekDay = RTC_WEEKDAY_MONDAY;

    /* Set time to default */
    Time.Hours = 0x00u;
    Time.Minutes = 0x00u;
    Time.Seconds = 0x00u;
    Time.TimeFormat = RTC_HOURFORMAT12_AM;

    /* Set the RTC current Time */
    status = HAL_RTC_SetTime(&RtcHandle, &Time, RTC_FORMAT_BCD);
    if(status != HAL_OK)
    {
      return KMODULE_ERROR_PRE;
    }

    /* Set the RTC current Date */
    HAL_RTC_SetDate(&RtcHandle, &Date, RTC_FORMAT_BCD);
    if(status != HAL_OK)
    {
      return KMODULE_ERROR_PRE;
    }
  }

  CharHeight = (((sFONT *)BSP_LCD_GetFont())->Height);
  CharWidth = (((sFONT *)BSP_LCD_GetFont())->Width);

  return KMODULE_OK;
}

/**
  * @brief  Run the applications 
  * @param  None.
  * @retval None.
  */
KMODULE_RETURN _CalendarDemoExec(void)
{
  /* App initialization    */
  kMenu_Execute(CalendarMenu);
  return KMODULE_OK;
}


/**
  * @brief  Run the applications 
  * @param  None.
  * @retval None.
  */
KMODULE_RETURN _CalendarExit(void)
{
  return KMODULE_OK;
}


/**
  * @brief  Get User action 
  * @param  sel : User selection (JOY_SEL,...)
  * @note   This example is the only way to get user information.  
  * @retval None
  */
void CalendarMenuUserAction(uint8_t sel)
{
  if (UserAction == 0)
  {
    UserAction = 1;
  }
  /* store user event */
  UserEvent = sel;
}


/**
  * @brief  Adjusts time.
  * @param  None
  * @retval None
  */
static void Calendar_TimeSet(void)
{
  /* Clear menu lines */
  Calendar_ClearMenuLines();

  /* PreAdjust Time */
  Calendar_TimePreAdjust();
}


/**
  * @brief  Displays the current time.
  * @param  time current time
  * @retval None
  */
static void Calendar_TimeDisplay(RTC_TimeTypeDef *time)
{
  char showtime[14] = {0};

  sprintf((char*)showtime,"     %02X:%02X:%02X",time->Hours, time->Minutes, time->Seconds);
  BSP_LCD_DisplayStringAtLine(TIME_LINE_NB, (uint8_t *) showtime);
}


/**
  * @brief  Displays information on LCD for the time configuration
  * @param  None
  * @retval None
  */
static void Calendar_TimePreAdjust(void)
{
  RTC_TimeTypeDef timecurrent = {0};
  RTC_TimeTypeDef timeset = {0};
  RTC_DateTypeDef dateset = {0};

  /* Get the RTC current Time */
  HAL_RTC_GetTime(&RtcHandle, &timecurrent, RTC_FORMAT_BCD);
  /* Get the RTC current Date */
  HAL_RTC_GetDate(&RtcHandle, &dateset, RTC_FORMAT_BCD);

  /* Display the current time */
  Calendar_TimeDisplay(&timecurrent);

  /* Call Time selection function */
  Calendar_TimeRegulate(&timecurrent, &timeset);

  /* Set the RTC current Time */
  HAL_RTC_SetTime(&RtcHandle, &timeset, RTC_FORMAT_BCD);
  /* Set the RTC current Date */
  HAL_RTC_SetDate(&RtcHandle, &dateset, RTC_FORMAT_BCD);
}


/**
  * @brief  Shows the current time (HH/MM/SS) on LCD.
  * @param  None
  * @retval None
  */
static void Calendar_TimeShow(void)
{
  uint32_t ypos = (CharHeight * (TIME_LINE_NB + 1));
  uint32_t xpos = (BSP_LCD_GetXSize() - 128) >> 1;
  RTC_TimeTypeDef time = {0};
  RTC_DateTypeDef date = {0};

  UserAction = 0x00u;

  /* Clear menu lines */
  Calendar_ClearMenuLines();

  kStorage_OpenFileDrawPixel(ypos, xpos, (uint8_t *)"STFILES/WATCH.BMP");

  /* Wait a press on any JoyStick pushbuttons */
  while (UserAction == 0x00u)
  {
    /* Get the RTC current Time */
    HAL_RTC_GetTime(&RtcHandle, &time, RTC_FORMAT_BCD);
    /* Get the RTC current Date */
    HAL_RTC_GetDate(&RtcHandle, &date, RTC_FORMAT_BCD);

    /* Display current time */
    Calendar_TimeDisplay(&time);
  }
}


/**
  * @brief  Adjusts the current date (MM/DD/YYYY).
  * @param  None
  * @retval None
  */
static void Calendar_DateSet(void)
{
  /* Get back font specifications */
  BSP_LCD_SetFont(&Font20);
  CharHeight = (((sFONT *)BSP_LCD_GetFont())->Height);
  CharWidth = (((sFONT *)BSP_LCD_GetFont())->Width);

  /* Clear the LCD */
  BSP_LCD_Clear(LCD_COLOR_WHITE);

  Calendar_DatePreAdjust();

  BSP_LCD_SetFont(&Font24);
  CharHeight = (((sFONT *)BSP_LCD_GetFont())->Height);
  CharWidth = (((sFONT *)BSP_LCD_GetFont())->Width);

}


/**
  * @brief  Displays the date in graphic mode.
  * @param  Year Year to display
  * @param  Month Month to display
  * @param  Date Date to display
  * @retval None
  */
static void Calendar_DateDisplay(uint8_t Year, uint8_t Month, uint8_t Day)
{
  uint32_t mline = 0, mcolumn = 319, month = 0;
  uint32_t monthlength = 0;
  char linedisplay[25];

  if (Month == 2)
  {
    if (Calendar_IsLeapYear(Year))
    {
      monthlength = 30;
    }
    else
    {
      monthlength = MonLen[Month - 1];
    }
  }
  else
  {
    monthlength = MonLen[Month - 1];
  }

  BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
  BSP_LCD_DrawRect(daycolumn, dayline, CharWidth*2, CharHeight-2);
  
  /* Set the Back Color */
  BSP_LCD_SetBackColor(LCD_COLOR_ST_PINK);
  BSP_LCD_SetTextColor(LCD_COLOR_ST_PINK);
  BSP_LCD_FillRect(0, 0, BSP_LCD_GetXSize(), Font20.Height);  
  BSP_LCD_FillRect(0, LINE(1), BSP_LCD_GetXSize(), Font20.Height);  
  /* Set the Text Color */
  BSP_LCD_SetTextColor(LCD_COLOR_WHITE);

  sprintf((char*)linedisplay,"    %s  20%02d     ", MonthNames[Month - 1], Year);
  BSP_LCD_DisplayStringAtLine(0, (uint8_t*)linedisplay);

  /* Determines the week number, day of the week of the selected date */
  Calendar_WeekDayNum(Year, Month, Day);
  DateNb = dn;

  sprintf((char*)linedisplay," WEEK: %02ld   DAY: %03ld    ", wn, dc);
  BSP_LCD_DisplayStringAtLine(1, (uint8_t*)linedisplay);

