STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoLegacy/Modules/calendar/app_calendar.c
  Calendar_DateDisplay(year, month, day);

  /* Regulate year */
  BSP_LCD_SetTextColor(LCD_COLOR_ST_PINK);
  BSP_LCD_DisplayStringAtLine(9, (uint8_t*) "UP/DOWN: Select Year");
  BSP_LCD_DisplayStringAtLine(10, (uint8_t*) "SEL: to set  ");
  Calendar_RegulateYear(&year, &month, &day);

  /* Regulate the month */
  BSP_LCD_SetTextColor(LCD_COLOR_ST_PINK);
  BSP_LCD_ClearStringLine(9);
  BSP_LCD_ClearStringLine(10);
  BSP_LCD_DisplayStringAtLine(9, (uint8_t*) "UP/DOWN: Select Month ");
  BSP_LCD_DisplayStringAtLine(10, (uint8_t*) "SEL: to set  ");
  Calendar_RegulateMonth(&year, &month, &day);

  /* Regulate day */
  BSP_LCD_SetTextColor(LCD_COLOR_ST_PINK);
  BSP_LCD_ClearStringLine(9);
  BSP_LCD_ClearStringLine(10);
  BSP_LCD_DisplayStringAtLine(9, (uint8_t*) "UP/DOWN/LEFT/RIGHT:");
  BSP_LCD_DisplayStringAtLine(10, (uint8_t*) "Select Day ");
  BSP_LCD_DisplayStringAtLine(11, (uint8_t*) "SEL: to set  ");
  Calendar_RegulateDay(&year, &month, &day);

  BSP_LCD_ClearStringLine(9);
  BSP_LCD_ClearStringLine(10);
  BSP_LCD_ClearStringLine(11);

  DateOutput->Year = RTC_ByteToBcd2(year);
  DateOutput->Month = RTC_ByteToBcd2(month);
  DateOutput->Date = RTC_ByteToBcd2(day);
  DateOutput->WeekDay= RTC_ByteToBcd2(DateNb+1);
}


/**
  * @brief  Monitor Year selection
  * @param  Year to be updated
  * @param  Month current month
  * @param  Day current day
  * @retval None
  */
static void Calendar_RegulateYear(uint8_t *Year, uint8_t *Month, uint8_t *Day)
{
  uint8_t tmpValue = *Year;

  /* Endless loop */
  while (UserEvent != JOY_SEL)
  {
    if ((UserEvent == JOY_UP) || (UserEvent == JOY_DOWN))
    {
      /* If "UP" pushbutton is pressed */
      if (UserEvent == JOY_UP)
      {
        /* Decrease the value of the digit */
        tmpValue++;

        if (tmpValue > 99)
        {
          tmpValue = 00;
        }
      }
      /* If "DOWN" pushbutton is pressed */
      if (UserEvent == JOY_DOWN)
      {
        /* Decrease the value of the digit */
        tmpValue--;
        if (tmpValue > 99)
        {
          tmpValue = 99;
        }
      }

      /* display updated calendar */
      Calendar_DateDisplay(tmpValue, *Month, *Day);

      /* Reset Globale variable */
      UserEvent = JOY_NONE;
    }
  }

  /* Reset Globale variable */
  UserEvent = JOY_NONE;

  /* return selected value */
  *Year = tmpValue;
}


/**
  * @brief  Monitor Month selection
  * @param  Year current year
  * @param  Month to be updated
  * @param  Day current day
  * @retval None
  */
static void Calendar_RegulateMonth(uint8_t *Year, uint8_t *Month, uint8_t *Day)
{
  uint8_t tmpValue = *Month;

  /* loop on Key press */
  while (UserEvent != JOY_SEL)
  {
    if ((UserEvent == JOY_UP) || (UserEvent == JOY_DOWN))
    {
      /* If "UP" pushbutton is pressed */
      if (UserEvent == JOY_UP)
      {
        /* Decrease the value of the digit */
        tmpValue++;

        if (tmpValue > 12)
        {
          tmpValue = 1;
        }
      }
      /* If "DOWN" pushbutton is pressed */
      if (UserEvent == JOY_DOWN)
      {
        /* Decrease the value of the digit */
        tmpValue--;
        if (tmpValue < 1)
        {
          tmpValue = 12;
        }
      }

      /* display updated calendar */
      Calendar_DateDisplay(*Year, tmpValue, *Day);

      /* Reset Globale variable */
      UserEvent = JOY_NONE;
    }
  }

  /* Reset Globale variable */
  UserEvent = JOY_NONE;

  /* return selected value */
  *Month = tmpValue;
}


/**
  * @brief  Monitor Day selection
  * @param  Year current year
  * @param  Month current month
  * @param  Day to be updated
  * @retval None
  */
static void Calendar_RegulateDay(uint8_t *Year, uint8_t *Month, uint8_t *Day)
{
  uint8_t tmpValue = *Day;
  uint32_t maxvalue= 0;
  uint8_t increase = 0;

  if (*Month == 2)
  {
    if (Calendar_IsLeapYear(*Year))
      { maxvalue= 29; }
    else
      { maxvalue= (MonLen[*Month - 1] - 1); }
  }
  else
  {
    maxvalue= (MonLen[*Month - 1] - 1);
  }

  /* loop on Key press */
  while (UserEvent != JOY_SEL)
  {
    if ((UserEvent != JOY_SEL) && (UserEvent != JOY_NONE))
    {
      if (UserEvent == JOY_UP)
      {
        tmpValue -= 7;
        increase = 0;
      }
      else if (UserEvent == JOY_DOWN)
      {
        tmpValue += 7;
        increase = 1;
      }
      else if (UserEvent == JOY_LEFT)
      {
        tmpValue--;
        increase = 0;
      }
      else if (UserEvent == JOY_RIGHT)
      {
        tmpValue++;
        increase = 1;
      }

      if (tmpValue > maxvalue)
      {
        if(increase != 0)
        {
          tmpValue = 1;
        }
        else
        {
          tmpValue = maxvalue;
        }
      }

      /* display updated calendar */
      Calendar_DateDisplay(*Year, *Month, tmpValue);

      /* Reset Globale variable */
      UserEvent = JOY_NONE;
    }
  }

  /* Reset Globale variable */
  UserEvent = JOY_NONE;

  /* return selected value */
  *Day = tmpValue;
}


/**
  * @brief  Adjusts time.
  * @param  None
  * @retval None
  */
static void Calendar_AlarmSet(void)
{
  uint32_t ypos = (CharHeight * (TIME_LINE_NB + 1));
  uint32_t xpos = (BSP_LCD_GetXSize() - 128) >> 1;

  /* Clear menu lines */
  Calendar_ClearMenuLines();

  kStorage_OpenFileDrawPixel(ypos, xpos, (uint8_t *)"STFILES/ALARM.BMP");

  /* PreAdjust Time */
  Calendar_AlarmPreAdjust();
}


/**
  * @brief  Displays information on LCD for the alarm time configuration
  * @param  None
  * @retval None
  */
static void Calendar_AlarmPreAdjust(void)
{
  RTC_TimeTypeDef timecurrent = {0};
  RTC_TimeTypeDef timeset = {0};
  RTC_DateTypeDef dateset = {0};
  RTC_AlarmTypeDef alarm = {0};


  /* Get the RTC current Time */
  HAL_RTC_GetTime(&RtcHandle, &timecurrent, RTC_FORMAT_BCD);
  /* Get the RTC current Date */
  HAL_RTC_GetDate(&RtcHandle, &dateset, RTC_FORMAT_BCD);

  /* Display the current time */
  Calendar_TimeDisplay(&timecurrent);

  /* Call Time selection function */
  Calendar_TimeRegulate(&timecurrent, &timeset);

  /* Get back alarm time */
  alarm.Alarm = RTC_ALARM_A;
  alarm.AlarmDateWeekDay = RTC_WEEKDAY_MONDAY;
  alarm.AlarmDateWeekDaySel = RTC_ALARMDATEWEEKDAYSEL_DATE;
  alarm.AlarmMask = RTC_ALARMMASK_DATEWEEKDAY;
  alarm.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_ALL;
  alarm.AlarmTime.TimeFormat = RTC_HOURFORMAT12_AM;
  alarm.AlarmTime.Hours = timeset.Hours;
  alarm.AlarmTime.Minutes = timeset.Minutes;
  alarm.AlarmTime.Seconds = timeset.Seconds;

  /* Set the new alarm time */
  HAL_RTC_SetAlarm_IT(&RtcHandle, &alarm, RTC_FORMAT_BCD);
}


/**
  * @brief  Adjusts Alarm.
  * @param  None
  * @retval None
  */
static void Calendar_AlarmDisable(void)
{
  /* Clear menu lines */
  Calendar_ClearMenuLines();

  /* Set the new alarm time */
  HAL_RTC_DeactivateAlarm(&RtcHandle, RTC_ALARM_A);

  /* Display information */
  BSP_LCD_DisplayStringAtLine(TIME_LINE_NB, (uint8_t *)"Alarm is disabled");
  HAL_Delay(500);
}


/**
  * @brief  Alarm A Irq Handler makes led toggling
  * @param  None
  * @retval None
  */
void HAL_RTC_AlarmAEventCallback(RTC_HandleTypeDef *hrtc)
{
  uint32_t time = 0x40;
  uint8_t led = 0;
  __IO uint32_t period;

  while(time > 0)
  {
    BSP_LED_Toggle((Led_TypeDef) led);

    /* manage led to toggle */
    led++;
    if(led > 3)
    {
      led = 0;

      /* waiting period */
      period = 0xFFFFF;
      while(period > 0)
      {
        period--;
      }
    }

    /* waiting period */
    period = 0xFFFFF;
    while(period > 0)
    {
      period--;
    }

    /* decrease time */
    time--;
  }

