STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoLegacy/Modules/calendar/app_calendar.c
  /* make sure led s are off when leaving */
  BSP_LED_Off(LED1);
  BSP_LED_Off(LED2);
  BSP_LED_Off(LED3);
  BSP_LED_Off(LED4);
}


/**
  * @brief  Manage menu lines clearing
  * @param  None
  * @retval None
  */
static void Calendar_ClearMenuLines(void)
{
  /* Clear menu lines */
  BSP_LCD_ClearStringLine(1);
  BSP_LCD_ClearStringLine(2);
  BSP_LCD_ClearStringLine(3);
}


/**
  * @brief  Determines the week number, the month number and the week day number.
  * @param  nyear: the week number
  * @param  nmonth: the month number
  * @param  nday: the week day number
  * @retval None
  */
static void Calendar_WeekDayNum(uint32_t nyear, uint8_t nmonth, uint8_t nday)
{
  uint32_t a = 0, b = 0, c = 0, s = 0, e = 0, f = 0, g = 0, d = 0;
  int32_t n = 0;
  if (nmonth < 3)
  {
    a = nyear - 1;
  }
  else
  {
    a = nyear;
  }

  b = (a / 4) - (a / 100) + (a / 400);
  c = ((a - 1) / 4) - ((a - 1) / 100) + ((a - 1) / 400);
  s = b - c;
  if (nmonth < 3)
  {
    e = 0;
    f =  nday - 1 + 31 * (nmonth - 1);
  }
  else
  {
    e = s + 1;
    f = nday + (153 * (nmonth - 3) + 2) / 5 + 58 + s;
  }
  g = (a + b) % 7;
  d = (f + g - e) % 7;
  n = f + 3 - d;
  if (n < 0)
  {
    wn = 53 - ((g - s) / 5);
  }
  else if (n > (364 + s))
  {
    wn = 1;
  }
  else
  {
    wn = (n / 7) + 1;
  }
  dn = d;
  dc = f + 1;
}


/**
  * @brief  Check whether the passed year is Leap or not.
  * @param  nYear: year number to be checked 
  * @retval 1: leap year
  *         0: not leap year
  */
static uint8_t Calendar_IsLeapYear(uint16_t nYear)
{
  if (nYear % 4 != 0) return 0;
  if (nYear % 100 != 0) return 1;
  return (uint8_t)(nYear % 400 == 0);
}


#undef __APP_CALENDAR_C
#endif
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
